# Найдите сумму цифр трехзначного числа.
# *Пример:*
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)
numb=int(input('Введите трехзначное число= '))
sum=0
while numb>0:
    temp=numb%10
    numb//=10
    sum += temp
print(sum)
